02_OpenFOAM_FVM/cases/Ejercicio6/cylinder_fine_alpha_pos5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          46;
        startFace       5270;
    }
    outlet
    {
        type            patch;
        nFaces          33;
        startFace       5316;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       5349;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          5505;
        startFace       5389;
    }
)

// ************************************************************************* //
